In [1]:
from sqlalchemy import create_engine

%load_ext sql

drivername = "postgresql"
username = "postgres"
password = "postgres"
host = "localhost"
port = "5432"
database = "analysis"

db_url = f"{drivername}://{username}:{password}@{host}/{database}"
engine = create_engine(db_url)

%sql engine

In [2]:
%%sql
table teachers

Running query in 'postgresql://postgres:***@localhost/analysis'

6 rows affected.

+----+------------+-----------+---------------------+------------+--------+
| id | first_name | last_name |        school       | hire_date  | salary |
+----+------------+-----------+---------------------+------------+--------+
| 1  |   Janet    |   Smith   |  F.D. Roosevelt HS  | 2011-10-30 | 36200  |
| 2  |    Lee     |  Reynolds |  F.D. Roosevelt HS  | 1993-05-22 | 65000  |
| 3  |   Samuel   |    Cole   | Myers Middle School | 2005-08-01 | 43500  |
| 4  |  Samantha  |    Bush   | Myers Middle School | 2011-10-30 | 36200  |
| 5  |   Betty    |    Diaz   | Myers Middle School | 2005-08-30 | 43500  |
| 6  |  Kathleen  |   Roush   |  F.D. Roosevelt HS  | 2010-10-22 | 38500  |
+----+------------+-----------+---------------------+------------+--------+

In [3]:
%%sql
SELECT last_name, first_name, salary FROM teachers

Running query in 'postgresql://postgres:***@localhost/analysis'

6 rows affected.

+-----------+------------+--------+
| last_name | first_name | salary |
+-----------+------------+--------+
|   Smith   |   Janet    | 36200  |
|  Reynolds |    Lee     | 65000  |
|    Cole   |   Samuel   | 43500  |
|    Bush   |  Samantha  | 36200  |
|    Diaz   |   Betty    | 43500  |
|   Roush   |  Kathleen  | 38500  |
+-----------+------------+--------+

In [4]:
%%sql
SELECT first_name, last_name, salary
FROM teachers
ORDER BY salary DESC

Running query in 'postgresql://postgres:***@localhost/analysis'

6 rows affected.

+------------+-----------+--------+
| first_name | last_name | salary |
+------------+-----------+--------+
|    Lee     |  Reynolds | 65000  |
|   Samuel   |    Cole   | 43500  |
|   Betty    |    Diaz   | 43500  |
|  Kathleen  |   Roush   | 38500  |
|   Janet    |   Smith   | 36200  |
|  Samantha  |    Bush   | 36200  |
+------------+-----------+--------+

In [5]:
%%sql
SELECT last_name, school, hire_date
FROM teachers
ORDER BY school ASC, hire_date DESC

Running query in 'postgresql://postgres:***@localhost/analysis'

6 rows affected.

+-----------+---------------------+------------+
| last_name |        school       | hire_date  |
+-----------+---------------------+------------+
|   Smith   |  F.D. Roosevelt HS  | 2011-10-30 |
|   Roush   |  F.D. Roosevelt HS  | 2010-10-22 |
|  Reynolds |  F.D. Roosevelt HS  | 1993-05-22 |
|    Bush   | Myers Middle School | 2011-10-30 |
|    Diaz   | Myers Middle School | 2005-08-30 |
|    Cole   | Myers Middle School | 2005-08-01 |
+-----------+---------------------+------------+

In [6]:
%%sql
select distinct school from teachers

Running query in 'postgresql://postgres:***@localhost/analysis'

2 rows affected.

+---------------------+
|        school       |
+---------------------+
| Myers Middle School |
|  F.D. Roosevelt HS  |
+---------------------+

In [7]:
%%sql
select hire_date school from teachers
order by hire_date desc;

Running query in 'postgresql://postgres:***@localhost/analysis'

6 rows affected.

+------------+
|   school   |
+------------+
| 2011-10-30 |
| 2011-10-30 |
| 2010-10-22 |
| 2005-08-30 |
| 2005-08-01 |
| 1993-05-22 |
+------------+

In [8]:
%%sql
SELECT distinct school, salary
FROM teachers
ORDER BY salary DESC

Running query in 'postgresql://postgres:***@localhost/analysis'

5 rows affected.

+---------------------+--------+
|        school       | salary |
+---------------------+--------+
|  F.D. Roosevelt HS  | 65000  |
| Myers Middle School | 43500  |
|  F.D. Roosevelt HS  | 38500  |
|  F.D. Roosevelt HS  | 36200  |
| Myers Middle School | 36200  |
+---------------------+--------+

In [9]:
%%sql
SELECT last_name, school, hire_date
FROM teachers
WHERE school = 'Myers Middle School'
order by hire_date desc;

Running query in 'postgresql://postgres:***@localhost/analysis'

3 rows affected.

+-----------+---------------------+------------+
| last_name |        school       | hire_date  |
+-----------+---------------------+------------+
|    Bush   | Myers Middle School | 2011-10-30 |
|    Diaz   | Myers Middle School | 2005-08-30 |
|    Cole   | Myers Middle School | 2005-08-01 |
+-----------+---------------------+------------+

In [10]:
%%sql
SELECT first_name, last_name, school
FROM teachers
WHERE first_name = 'Janet';

Running query in 'postgresql://postgres:***@localhost/analysis'

1 rows affected.

+------------+-----------+-------------------+
| first_name | last_name |       school      |
+------------+-----------+-------------------+
|   Janet    |   Smith   | F.D. Roosevelt HS |
+------------+-----------+-------------------+

In [11]:
%%sql
SELECT school
FROM teachers
WHERE school <> 'F.D. Roosevelt HS';

Running query in 'postgresql://postgres:***@localhost/analysis'

3 rows affected.

+---------------------+
|        school       |
+---------------------+
| Myers Middle School |
| Myers Middle School |
| Myers Middle School |
+---------------------+

In [12]:
%%sql
SELECT first_name, last_name, hire_date, salary
FROM teachers
WHERE hire_date < '2000-01-01';

Running query in 'postgresql://postgres:***@localhost/analysis'

1 rows affected.

+------------+-----------+------------+--------+
| first_name | last_name | hire_date  | salary |
+------------+-----------+------------+--------+
|    Lee     |  Reynolds | 1993-05-22 | 65000  |
+------------+-----------+------------+--------+

In [13]:
%%sql
SELECT first_name, last_name, salary
FROM teachers
WHERE salary >= 43500;

Running query in 'postgresql://postgres:***@localhost/analysis'

3 rows affected.

+------------+-----------+--------+
| first_name | last_name | salary |
+------------+-----------+--------+
|    Lee     |  Reynolds | 65000  |
|   Samuel   |    Cole   | 43500  |
|   Betty    |    Diaz   | 43500  |
+------------+-----------+--------+

In [14]:
%%sql
SELECT first_name, last_name, school, salary
FROM teachers
WHERE salary BETWEEN 40000 AND 65000;

Running query in 'postgresql://postgres:***@localhost/analysis'

3 rows affected.

+------------+-----------+---------------------+--------+
| first_name | last_name |        school       | salary |
+------------+-----------+---------------------+--------+
|    Lee     |  Reynolds |  F.D. Roosevelt HS  | 65000  |
|   Samuel   |    Cole   | Myers Middle School | 43500  |
|   Betty    |    Diaz   | Myers Middle School | 43500  |
+------------+-----------+---------------------+--------+

In [15]:
%%sql
SELECT first_name, last_name, school, salary
FROM teachers
WHERE salary >= 40000 AND salary <=65000;

Running query in 'postgresql://postgres:***@localhost/analysis'

3 rows affected.

+------------+-----------+---------------------+--------+
| first_name | last_name |        school       | salary |
+------------+-----------+---------------------+--------+
|    Lee     |  Reynolds |  F.D. Roosevelt HS  | 65000  |
|   Samuel   |    Cole   | Myers Middle School | 43500  |
|   Betty    |    Diaz   | Myers Middle School | 43500  |
+------------+-----------+---------------------+--------+

In [16]:
%%sql
SELECT first_name
FROM teachers
WHERE first_name LIKE 'sam%';

Running query in 'postgresql://postgres:***@localhost/analysis'

+------------+
| first_name |
+------------+
+------------+

In [17]:
%%sql
SELECT first_name
FROM teachers
WHERE first_name iLIKE 'sam%';

Running query in 'postgresql://postgres:***@localhost/analysis'

2 rows affected.

+------------+
| first_name |
+------------+
|   Samuel   |
|  Samantha  |
+------------+

In [18]:
%%sql
SELECT *
FROM teachers
WHERE school = 'Myers Middle School' AND salary < 40000;

Running query in 'postgresql://postgres:***@localhost/analysis'

1 rows affected.

+----+------------+-----------+---------------------+------------+--------+
| id | first_name | last_name |        school       | hire_date  | salary |
+----+------------+-----------+---------------------+------------+--------+
| 4  |  Samantha  |    Bush   | Myers Middle School | 2011-10-30 | 36200  |
+----+------------+-----------+---------------------+------------+--------+

In [19]:
%%sql
SELECT *
FROM teachers
WHERE last_name = 'Cole'
      OR last_name = 'Bush';

Running query in 'postgresql://postgres:***@localhost/analysis'

2 rows affected.

+----+------------+-----------+---------------------+------------+--------+
| id | first_name | last_name |        school       | hire_date  | salary |
+----+------------+-----------+---------------------+------------+--------+
| 3  |   Samuel   |    Cole   | Myers Middle School | 2005-08-01 | 43500  |
| 4  |  Samantha  |    Bush   | Myers Middle School | 2011-10-30 | 36200  |
+----+------------+-----------+---------------------+------------+--------+

In [20]:
%%sql
SELECT *
FROM teachers
WHERE school = 'F.D. Roosevelt HS'
      AND (salary < 38000 OR salary > 40000);

Running query in 'postgresql://postgres:***@localhost/analysis'

2 rows affected.

+----+------------+-----------+-------------------+------------+--------+
| id | first_name | last_name |       school      | hire_date  | salary |
+----+------------+-----------+-------------------+------------+--------+
| 1  |   Janet    |   Smith   | F.D. Roosevelt HS | 2011-10-30 | 36200  |
| 2  |    Lee     |  Reynolds | F.D. Roosevelt HS | 1993-05-22 | 65000  |
+----+------------+-----------+-------------------+------------+--------+

In [21]:
%%sql
SELECT first_name, last_name, school, hire_date, salary
FROM teachers
WHERE school LIKE '%Roos%'
ORDER BY hire_date DESC;

Running query in 'postgresql://postgres:***@localhost/analysis'

3 rows affected.

+------------+-----------+-------------------+------------+--------+
| first_name | last_name |       school      | hire_date  | salary |
+------------+-----------+-------------------+------------+--------+
|   Janet    |   Smith   | F.D. Roosevelt HS | 2011-10-30 | 36200  |
|  Kathleen  |   Roush   | F.D. Roosevelt HS | 2010-10-22 | 38500  |
|    Lee     |  Reynolds | F.D. Roosevelt HS | 1993-05-22 | 65000  |
+------------+-----------+-------------------+------------+--------+

In [22]:
%%sql
SELECT *
FROM teachers
WHERE school LIKE '%Roos%'
ORDER BY hire_date DESC;

Running query in 'postgresql://postgres:***@localhost/analysis'

3 rows affected.

+----+------------+-----------+-------------------+------------+--------+
| id | first_name | last_name |       school      | hire_date  | salary |
+----+------------+-----------+-------------------+------------+--------+
| 1  |   Janet    |   Smith   | F.D. Roosevelt HS | 2011-10-30 | 36200  |
| 6  |  Kathleen  |   Roush   | F.D. Roosevelt HS | 2010-10-22 | 38500  |
| 2  |    Lee     |  Reynolds | F.D. Roosevelt HS | 1993-05-22 | 65000  |
+----+------------+-----------+-------------------+------------+--------+